OS-Q/A511/boards.txt
##############################################################

lolin32-lite.name=WEMOS LOLIN32 Lite

lolin32-lite.upload.tool=esptool_py
lolin32-lite.upload.maximum_size=1310720
lolin32-lite.upload.maximum_data_size=327680
lolin32-lite.upload.wait_for_upload_port=true

lolin32-lite.serial.disableDTR=true
lolin32-lite.serial.disableRTS=true

lolin32-lite.build.mcu=esp32
lolin32-lite.build.core=esp32
lolin32-lite.build.variant=lolin32-lite
lolin32-lite.build.board=LOLIN32 Lite

lolin32-lite.build.f_cpu=240000000L
lolin32-lite.build.flash_mode=dio
lolin32-lite.build.flash_size=4MB
lolin32-lite.build.boot=dio
lolin32-lite.build.partitions=default
lolin32-lite.build.defines=

lolin32-lite.menu.FlashFreq.80=80MHz
lolin32-lite.menu.FlashFreq.80.build.flash_freq=80m
lolin32-lite.menu.FlashFreq.40=40MHz
lolin32-lite.menu.FlashFreq.40.build.flash_freq=40m

lolin32-lite.menu.PartitionScheme.default=Default
lolin32-lite.menu.PartitionScheme.default.build.partitions=default
lolin32-lite.menu.PartitionScheme.no_ota=No OTA (Large APP)
lolin32-lite.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin32-lite.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin32-lite.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
lolin32-lite.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
lolin32-lite.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

lolin32-lite.menu.CPUFreq.240=240MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.240.build.f_cpu=240000000L
lolin32-lite.menu.CPUFreq.160=160MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.160.build.f_cpu=160000000L
lolin32-lite.menu.CPUFreq.80=80MHz (WiFi/BT)
lolin32-lite.menu.CPUFreq.80.build.f_cpu=80000000L
lolin32-lite.menu.CPUFreq.40=40MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.40.build.f_cpu=40000000L
lolin32-lite.menu.CPUFreq.26=26MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.26.build.f_cpu=26000000L
lolin32-lite.menu.CPUFreq.20=20MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.20.build.f_cpu=20000000L
lolin32-lite.menu.CPUFreq.13=13MHz (26MHz XTAL)
lolin32-lite.menu.CPUFreq.13.build.f_cpu=13000000L
lolin32-lite.menu.CPUFreq.10=10MHz (40MHz XTAL)
lolin32-lite.menu.CPUFreq.10.build.f_cpu=10000000L

lolin32-lite.menu.UploadSpeed.921600=921600
lolin32-lite.menu.UploadSpeed.921600.upload.speed=921600
lolin32-lite.menu.UploadSpeed.115200=115200
lolin32-lite.menu.UploadSpeed.115200.upload.speed=115200
lolin32-lite.menu.UploadSpeed.256000.windows=256000
lolin32-lite.menu.UploadSpeed.256000.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin32-lite.menu.UploadSpeed.230400=230400
lolin32-lite.menu.UploadSpeed.230400.upload.speed=230400
lolin32-lite.menu.UploadSpeed.460800.linux=460800
lolin32-lite.menu.UploadSpeed.460800.macosx=460800
lolin32-lite.menu.UploadSpeed.460800.upload.speed=460800
lolin32-lite.menu.UploadSpeed.512000.windows=512000
lolin32-lite.menu.UploadSpeed.512000.upload.speed=512000

##############################################################

node32s.name=Node32s

node32s.upload.tool=esptool_py
node32s.upload.maximum_size=1310720
node32s.upload.maximum_data_size=327680
node32s.upload.wait_for_upload_port=true

node32s.serial.disableDTR=true
node32s.serial.disableRTS=true

node32s.build.mcu=esp32
node32s.build.core=esp32
node32s.build.variant=node32s
node32s.build.board=Node32s

node32s.build.f_cpu=240000000L
node32s.build.flash_mode=dio
node32s.build.flash_size=4MB
node32s.build.boot=dio
node32s.build.partitions=default
node32s.build.defines=

node32s.menu.PartitionScheme.default=Default
node32s.menu.PartitionScheme.default.build.partitions=default
node32s.menu.PartitionScheme.no_ota=No OTA (Large APP)
node32s.menu.PartitionScheme.no_ota.build.partitions=no_ota
node32s.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
node32s.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
node32s.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
node32s.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

node32s.menu.FlashFreq.80=80MHz
node32s.menu.FlashFreq.80.build.flash_freq=80m
node32s.menu.FlashFreq.40=40MHz
node32s.menu.FlashFreq.40.build.flash_freq=40m

node32s.menu.UploadSpeed.921600=921600
node32s.menu.UploadSpeed.921600.upload.speed=921600
node32s.menu.UploadSpeed.115200=115200
node32s.menu.UploadSpeed.115200.upload.speed=115200
node32s.menu.UploadSpeed.256000.windows=256000
node32s.menu.UploadSpeed.256000.upload.speed=256000
node32s.menu.UploadSpeed.230400.windows.upload.speed=256000
node32s.menu.UploadSpeed.230400=230400
node32s.menu.UploadSpeed.230400.upload.speed=230400
node32s.menu.UploadSpeed.460800.linux=460800
node32s.menu.UploadSpeed.460800.macosx=460800
node32s.menu.UploadSpeed.460800.upload.speed=460800
node32s.menu.UploadSpeed.512000.windows=512000
node32s.menu.UploadSpeed.512000.upload.speed=512000

node32s.menu.DebugLevel.none=None
node32s.menu.DebugLevel.none.build.code_debug=0
node32s.menu.DebugLevel.error=Error
node32s.menu.DebugLevel.error.build.code_debug=1
node32s.menu.DebugLevel.warn=Warn
node32s.menu.DebugLevel.warn.build.code_debug=2
node32s.menu.DebugLevel.info=Info
node32s.menu.DebugLevel.info.build.code_debug=3
node32s.menu.DebugLevel.debug=Debug
node32s.menu.DebugLevel.debug.build.code_debug=4
node32s.menu.DebugLevel.verbose=Verbose
node32s.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

nodemcu-32s.name=NodeMCU-32S

nodemcu-32s.upload.tool=esptool_py
nodemcu-32s.upload.maximum_size=1310720
nodemcu-32s.upload.maximum_data_size=327680
nodemcu-32s.upload.wait_for_upload_port=true

nodemcu-32s.serial.disableDTR=true
nodemcu-32s.serial.disableRTS=true

nodemcu-32s.build.mcu=esp32
nodemcu-32s.build.core=esp32
nodemcu-32s.build.variant=nodemcu-32s
nodemcu-32s.build.board=NodeMCU_32S

nodemcu-32s.build.f_cpu=240000000L
nodemcu-32s.build.flash_mode=dio
nodemcu-32s.build.flash_size=4MB
nodemcu-32s.build.boot=dio
nodemcu-32s.build.partitions=default
nodemcu-32s.build.defines=

nodemcu-32s.menu.FlashFreq.80=80MHz
nodemcu-32s.menu.FlashFreq.80.build.flash_freq=80m
nodemcu-32s.menu.FlashFreq.40=40MHz
nodemcu-32s.menu.FlashFreq.40.build.flash_freq=40m

nodemcu-32s.menu.UploadSpeed.921600=921600
nodemcu-32s.menu.UploadSpeed.921600.upload.speed=921600
nodemcu-32s.menu.UploadSpeed.115200=115200
nodemcu-32s.menu.UploadSpeed.115200.upload.speed=115200
nodemcu-32s.menu.UploadSpeed.256000.windows=256000
nodemcu-32s.menu.UploadSpeed.256000.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400.windows.upload.speed=256000
nodemcu-32s.menu.UploadSpeed.230400=230400
nodemcu-32s.menu.UploadSpeed.230400.upload.speed=230400
nodemcu-32s.menu.UploadSpeed.460800.linux=460800
nodemcu-32s.menu.UploadSpeed.460800.macosx=460800
nodemcu-32s.menu.UploadSpeed.460800.upload.speed=460800
nodemcu-32s.menu.UploadSpeed.512000.windows=512000
nodemcu-32s.menu.UploadSpeed.512000.upload.speed=512000

