OS-Q/A511/boards.txt
##############################################################

mhetesp32devkit.name=MH ET LIVE ESP32DevKIT

mhetesp32devkit.upload.tool=esptool_py
mhetesp32devkit.upload.maximum_size=1310720
mhetesp32devkit.upload.maximum_data_size=327680
mhetesp32devkit.upload.wait_for_upload_port=true

mhetesp32devkit.serial.disableDTR=true
mhetesp32devkit.serial.disableRTS=true

mhetesp32devkit.build.mcu=esp32
mhetesp32devkit.build.core=esp32
mhetesp32devkit.build.variant=mhetesp32devkit
mhetesp32devkit.build.board=MH_ET_LIVE_ESP32DEVKIT

mhetesp32devkit.build.f_cpu=240000000L
mhetesp32devkit.build.flash_mode=dio
mhetesp32devkit.build.flash_size=4MB
mhetesp32devkit.build.boot=dio
mhetesp32devkit.build.partitions=default
mhetesp32devkit.build.defines=

mhetesp32devkit.menu.FlashFreq.80=80MHz
mhetesp32devkit.menu.FlashFreq.80.build.flash_freq=80m
mhetesp32devkit.menu.FlashFreq.40=40MHz
mhetesp32devkit.menu.FlashFreq.40.build.flash_freq=40m

mhetesp32devkit.menu.PartitionScheme.default=Default
mhetesp32devkit.menu.PartitionScheme.default.build.partitions=default
mhetesp32devkit.menu.PartitionScheme.no_ota=No OTA (Large APP)
mhetesp32devkit.menu.PartitionScheme.no_ota.build.partitions=no_ota
mhetesp32devkit.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
mhetesp32devkit.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
mhetesp32devkit.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
mhetesp32devkit.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

mhetesp32devkit.menu.UploadSpeed.921600=921600
mhetesp32devkit.menu.UploadSpeed.921600.upload.speed=921600
mhetesp32devkit.menu.UploadSpeed.115200=115200
mhetesp32devkit.menu.UploadSpeed.115200.upload.speed=115200
mhetesp32devkit.menu.UploadSpeed.256000.windows=256000
mhetesp32devkit.menu.UploadSpeed.256000.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400.windows.upload.speed=256000
mhetesp32devkit.menu.UploadSpeed.230400=230400
mhetesp32devkit.menu.UploadSpeed.230400.upload.speed=230400
mhetesp32devkit.menu.UploadSpeed.460800.linux=460800
mhetesp32devkit.menu.UploadSpeed.460800.macosx=460800
mhetesp32devkit.menu.UploadSpeed.460800.upload.speed=460800
mhetesp32devkit.menu.UploadSpeed.512000.windows=512000
mhetesp32devkit.menu.UploadSpeed.512000.upload.speed=512000

mhetesp32devkit.menu.DebugLevel.none=None
mhetesp32devkit.menu.DebugLevel.none.build.code_debug=0
mhetesp32devkit.menu.DebugLevel.error=Error
mhetesp32devkit.menu.DebugLevel.error.build.code_debug=1
mhetesp32devkit.menu.DebugLevel.warn=Warn
mhetesp32devkit.menu.DebugLevel.warn.build.code_debug=2
mhetesp32devkit.menu.DebugLevel.info=Info
mhetesp32devkit.menu.DebugLevel.info.build.code_debug=3
mhetesp32devkit.menu.DebugLevel.debug=Debug
mhetesp32devkit.menu.DebugLevel.debug.build.code_debug=4
mhetesp32devkit.menu.DebugLevel.verbose=Verbose
mhetesp32devkit.menu.DebugLevel.verbose.build.code_debug=5



##############################################################

esp32-poe.name=OLIMEX ESP32-PoE

esp32-poe.upload.tool=esptool_py
esp32-poe.upload.maximum_size=1310720
esp32-poe.upload.maximum_data_size=327680
esp32-poe.upload.wait_for_upload_port=true

esp32-poe.serial.disableDTR=true
esp32-poe.serial.disableRTS=true

esp32-poe.build.mcu=esp32
esp32-poe.build.core=esp32
esp32-poe.build.variant=esp32-poe
esp32-poe.build.board=ESP32_POE

esp32-poe.build.f_cpu=240000000L
esp32-poe.build.flash_mode=dio
esp32-poe.build.flash_size=4MB
esp32-poe.build.boot=dio
esp32-poe.build.partitions=default
esp32-poe.build.defines=

esp32-poe.menu.FlashFreq.80=80MHz
esp32-poe.menu.FlashFreq.80.build.flash_freq=80m
esp32-poe.menu.FlashFreq.40=40MHz
esp32-poe.menu.FlashFreq.40.build.flash_freq=40m


esp32-poe.menu.UploadSpeed.115200=115200
esp32-poe.menu.UploadSpeed.115200.upload.speed=115200

esp32-poe.menu.PartitionScheme.default=Default
esp32-poe.menu.PartitionScheme.default.build.partitions=default
esp32-poe.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-poe.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-poe.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-poe.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-poe.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-poe.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

##############################################################

esp32-poe-iso.name=OLIMEX ESP32-PoE-ISO

esp32-poe-iso.upload.tool=esptool_py
esp32-poe-iso.upload.maximum_size=1310720
esp32-poe-iso.upload.maximum_data_size=327680
esp32-poe-iso.upload.wait_for_upload_port=true

esp32-poe-iso.serial.disableDTR=true
esp32-poe-iso.serial.disableRTS=true

esp32-poe-iso.build.mcu=esp32
esp32-poe-iso.build.core=esp32
esp32-poe-iso.build.variant=esp32-poe-iso
esp32-poe-iso.build.board=ESP32_POE_ISO

esp32-poe-iso.build.f_cpu=240000000L
esp32-poe-iso.build.flash_mode=dio
esp32-poe-iso.build.flash_size=4MB
esp32-poe-iso.build.boot=dio
esp32-poe-iso.build.partitions=default
esp32-poe-iso.build.defines=

esp32-poe-iso.menu.FlashFreq.80=80MHz
esp32-poe-iso.menu.FlashFreq.80.build.flash_freq=80m
esp32-poe-iso.menu.FlashFreq.40=40MHz
esp32-poe-iso.menu.FlashFreq.40.build.flash_freq=40m


esp32-poe-iso.menu.UploadSpeed.115200=115200
esp32-poe-iso.menu.UploadSpeed.115200.upload.speed=115200

esp32-poe-iso.menu.PartitionScheme.default=Default
esp32-poe-iso.menu.PartitionScheme.default.build.partitions=default
esp32-poe-iso.menu.PartitionScheme.no_ota=No OTA (Large APP)
esp32-poe-iso.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32-poe-iso.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32-poe-iso.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
esp32-poe-iso.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32-poe-iso.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

##############################################################

esp32-DevKitLipo.name=OLIMEX ESP32-DevKit-LiPo

esp32-DevKitLipo.upload.tool=esptool_py
esp32-DevKitLipo.upload.maximum_size=1310720
esp32-DevKitLipo.upload.maximum_data_size=327680
esp32-DevKitLipo.upload.wait_for_upload_port=true

esp32-DevKitLipo.serial.disableDTR=true
esp32-DevKitLipo.serial.disableRTS=true

